Data-Science-in-Mechanical-Engineering/CATS/hardware_implementation/mixer/src/mixer/nrf52840/mixer_transport_ble.c
// There can be additional sources for timing jitter that must be covered.
// One such source is unknown jitter and/or delay in the TX ramp up time. For instance, the nRF
// Product Specification (4413_417 v1.0 6.20.15.8) states TX enable time as typically 40us, but
// without any information about min. and max. values. v1.1 of the document says min = max = 40us,
// but t_READYJITTER = 0.25us, which is a contradiction. From our impression the full ramp up time
// seems 1...3us longer, so we take that into account.
#define JITTER_TOLERANCE			GPI_TICK_US_TO_HYBRID(4)

// Max. propagation delay of the radio signal transmitted over the air, also known as time-of-flight.
// Considering the speed of light, 1us corresponds to a node distance of 300m.
#define MAX_PROPAGATION_DELAY		GPI_TICK_US_TO_HYBRID(1)

// NOTE: In 802.15.4 experiments we observed that the timestamps of FRAMESTART events at transmitter
// and receiver show ~40us time difference. Fabian wrote that based on experiments, it seems that
// the delta splits evenly among the transmitter and receiver paths, although it is unclear how he
// isolated the contributions (maybe using a TelosB as reference).
// In BLE 1M experiments we observed a delay of ~10us wrt. the ADDRESS event, and comparing the
// timestamps with TASKS_START at the transmitter (routed to GPIOTE via PPI) we found delays of
// -0.81us (yes, its negative) at the transmitter and 9.50...9.78us at the receiver (see Carsten's
// experiments for details).
// So it seems that the delta corresponds to about 10 bit times independent of the radio mode.
// Note that the individual receiver and transmitter contributions are not important as long as
// all nodes use the same radio platform (as tx and rx delays sum up at the receiver), but they
// are important when using different radios in the same network (then the grid must relate to a
// defined point in the radio packet on air, not just a fixed but not precisely known point).
// 802.15.4 : 20 us
// BLE 1M   : 10 us
// BLE 2M   : 5 us
#if (MX_PHY_MODE == MX_BLE_MODE_1M)
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2((1 + 4 + 2 + PHY_PAYLOAD_SIZE + 3) * 8)
	#define GRID_TO_RX_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(5 * 8 + 10)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2((2 + PHY_PAYLOAD_SIZE + 3) * (8 + 1))	// NOTE: +1 incl. tolerance for clock drift
#elif (MX_PHY_MODE == MX_BLE_MODE_2M)
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2((2 + 4 + 2 + PHY_PAYLOAD_SIZE + 3) * 4)
	#define GRID_TO_RX_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(6 * 4 + 5)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2(((2 + PHY_PAYLOAD_SIZE + 3) * (8 + 1)) / 2)
										// = (2 + PHY_PAYLOAD_SIZE + 3) * (4 + 0.5) incl. +0.5 tolerance for clock drift
#elif (MX_PHY_MODE == MX_BLE_MODE_500k)
	#error "BLE 500k mode should not be used without re-checking the timing constants (see source code for details)"
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2(80 + 256 + 16 + 24 + ((((2 + PHY_PAYLOAD_SIZE + 3) * 8) + 3) * 2))
	// TODO: add event signaling latency (10 bit times?)
	#define GRID_TO_RX_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(80 + 256 + 0)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2(16 + 24 + (2 + PHY_PAYLOAD_SIZE + 3) * (16 + 1))	// NOTE: +1 incl. tolerance for clock drift
#elif (MX_PHY_MODE == MX_BLE_MODE_125k)
	#error "BLE 125k mode should not be used without re-checking the timing constants (see source code for details)"
	#define PACKET_AIR_TIME			GPI_TICK_US_TO_HYBRID2(80 + 256 + 16 + 24 + ((((2 + PHY_PAYLOAD_SIZE + 3) * 8) + 3) * 8))
	// TODO: add event signaling latency (10 bit times?)
	#define GRID_TO_RX_EVENT_OFFSET	GPI_TICK_US_TO_HYBRID(80 + 256 + 0)		// preamble + address + event signaling latency
	#define RX_DMA_TIMEOUT			GPI_TICK_US_TO_FAST2(16 + 24 + (2 + PHY_PAYLOAD_SIZE + 3) * (64 + 1))	// NOTE: +1 incl. tolerance for clock drift
#else
	#error "MX_PHY_MODE is invalid or unsupported"
#endif

#define RX_TO_GRID_OFFSET			(0 + GPI_TICK_US_TO_HYBRID(40))			// software latency + RX ramp up time
#define TX_TO_GRID_OFFSET			(16 + GPI_TICK_US_TO_HYBRID(40))		// software latency + TX ramp up time
	// from our impression, TX ramp up time is 40us + 1...3us. for details see comments regarding JITTER_TOLERANCE

#define RX_WINDOW_INCREMENT			((3 * DRIFT_TOLERANCE) / 2)
	// factor 1.5 is important to widen the window in next slot (factor 1 would follow only)
#define RX_WINDOW_MIN				(2 * ((3 * DRIFT_TOLERANCE) + (2 * JITTER_TOLERANCE) + GPI_TICK_US_TO_HYBRID(5)))
	// minimum must cover DRIFT_TOLERANCE, JITTER_TOLERANCE, variations in RX ramp up time,
	// and variations in execution time from timer polling to RX on. The factor on DRIFT_TOLERANCE
	// accounts for additional uncertainties following from the control loop (i.e., tracking the grid).
	// JITTER_TOLERANCE can be effective peak-to-peak (e.g. TX delay at node A -> causes grid delay
	// at node B, + TX delay at node B -> 2x delay at node A)
#define RX_WINDOW_MAX				MIN(0x7FFFFFFF, MIN(RX_WINDOW_MIN + (20 * RX_WINDOW_INCREMENT), (MX_SLOT_LENGTH - PACKET_AIR_TIME - RX_TO_GRID_OFFSET - ISR_LATENCY_BUFFER) / 2))

// NOTE: choosing applicable RX_WINDOW_... settings can be critical if the network density is very low
// compared to the number of nodes (or the number of really existing nodes is far below MX_NUM_NODES).
// The ratio (RX_WINDOW_MAX - RX_WINDOW_MIN) / RX_WINDOW_INCREMENT determines the maximum number of slots
// without any reception before a node enters resync mode. Resync mode by itself is not critical, but
// if *all* nodes enter resync simultaneously it will destroy the round. So on one hand a node that indeed
// lost sync should not wait too long before entering resync, but on the other hand the waiting time should
// be not to short to keep the probability that all nodes enter resync simultaneously as low as possible.
ASSERT_CT_WARN_STATIC(((RX_WINDOW_MAX - RX_WINDOW_MIN) / RX_WINDOW_INCREMENT) >= 10, critical_RX_WINDOW_settings);

