Data-Science-in-Mechanical-Engineering/CATS/hardware_implementation/mixer/src/mixer/nrf52840/mixer_transport_ble.c
#define GRID_DRIFT_FILTER_DIV		4
#define GRID_TICK_UPDATE_DIV		2
#define GRID_DRIFT_MAX				MIN(((3 * DRIFT_TOLERANCE) + JITTER_TOLERANCE) * GRID_TICK_UPDATE_DIV * GRID_DRIFT_FILTER_DIV, 0x7FFFFF)
	// P control loop has a permanent deviation since control_value = drift / GRID_TICK_UPDATE_DIV
	// -> to be able to compensate for drift up to DRIFT_TOLERANCE, GRID_DRIFT_MAX must be > DRIFT_TOLERANCE * GRID_TICK_UPDATE_DIV
	// Additional to this, the control loop doesn't get a new measurement in every slot, so the single-value
	// measurement may exceed the theoretical limit. Therefore we add a margin factor.
#define TX_OFFSET_FILTER_DIV		8
#define TX_OFFSET_MAX				(MAX_PROPAGATION_DELAY + GPI_TICK_US_TO_HYBRID(2))

//**************************************************************************************************

#ifndef GPI_ARM_NRF_FAST_CLOCK_TIMER
	#error "GPI_ARM_NRF_FAST_CLOCK_TIMER is unknown"
#elif (0 == GPI_ARM_NRF_FAST_CLOCK_TIMER)
	#define MAIN_TIMER				NRF_TIMER0
	#define MAIN_TIMER_IRQ			TIMER0_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER0_IRQHandler
#elif (1 == GPI_ARM_NRF_FAST_CLOCK_TIMER)
	#define MAIN_TIMER				NRF_TIMER1
	#define MAIN_TIMER_IRQ			TIMER1_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER1_IRQHandler
#elif (2 == GPI_ARM_NRF_FAST_CLOCK_TIMER)
	#define MAIN_TIMER				NRF_TIMER2
	#define MAIN_TIMER_IRQ			TIMER2_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER2_IRQHandler
#elif (3 == GPI_ARM_NRF_FAST_CLOCK_TIMER)
	#define MAIN_TIMER				NRF_TIMER3
	#define MAIN_TIMER_IRQ			TIMER3_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER3_IRQHandler
#elif (4 == GPI_ARM_NRF_FAST_CLOCK_TIMER)
	#define MAIN_TIMER				NRF_TIMER4
	#define MAIN_TIMER_IRQ			TIMER4_IRQn
	#define MAIN_TIMER_ISR_NAME		TIMER4_IRQHandler
#else
	#error "GPI_ARM_NRF_FAST_CLOCK_TIMER is invalid"
#endif

#define MAIN_TIMER_CC_INDEX			3
#define MAIN_TIMER_CC_REG			(MAIN_TIMER->CC[MAIN_TIMER_CC_INDEX])
#define EVENT_CAPTURE_CC_INDEX		2
#define EVENT_CAPTURE_CC_REG		(MAIN_TIMER->CC[EVENT_CAPTURE_CC_INDEX])

#define NRF_PPI_CHANNEL				0	// timer <-> radio (start, SFD capture, ...)
#define NRF_PPI_CHANNEL_2			1	// ADDRESS -> Bitcounter

// reserve resources to enable GPI's automatic resource checks
// NOTE: reserve everything as shared to enable other usage while mixer is inactive
GPI_RESOURCE_RESERVE_SHARED(NRF_RADIO);
GPI_RESOURCE_RESERVE_SHARED(NRF_TIMER, GPI_ARM_NRF_FAST_CLOCK_TIMER);
GPI_RESOURCE_RESERVE_SHARED(NRF_TIMER_CC, GPI_ARM_NRF_FAST_CLOCK_TIMER, MAIN_TIMER_CC_INDEX);
GPI_RESOURCE_RESERVE_SHARED(NRF_TIMER_CC, GPI_ARM_NRF_FAST_CLOCK_TIMER, EVENT_CAPTURE_CC_INDEX);
GPI_RESOURCE_RESERVE_SHARED(NRF_PPI);
GPI_RESOURCE_RESERVE_SHARED(NRF_PPI_CH, NRF_PPI_CHANNEL);
GPI_RESOURCE_RESERVE_SHARED(NRF_PPI_CH, NRF_PPI_CHANNEL_2);

//**************************************************************************************************

#if MX_VERBOSE_STATISTICS
	#define LED_ISR(name, led)									\
		name ## _ ();											\
		void name() {											\
			if (gpi_wakeup_event) {								\
				mx.wake_up_timestamp = gpi_tick_fast_native();	\
				gpi_wakeup_event = 0;							\
			}													\
			gpi_led_toggle(led);								\
			name ## _ ();										\
			gpi_led_toggle(led);								\
		}														\
		void name ## _ ()
#else
	#define LED_ISR(name, led)									\
		name ## _ ();											\
		void name() {											\
			gpi_led_toggle(led);								\
			name ## _ ();										\
			gpi_led_toggle(led);								\
		}														\
		void name ## _ ()
#endif

//**************************************************************************************************
//***** Local Typedefs and Class Declarations ******************************************************

typedef enum Slot_State_tag
{
	RESYNC		= 0,
	RX_RUNNING	= 16,
	TX_RUNNING	= 12,
	IDLE		= 12,	// ATTENTION: TX and IDLE are not distinguished here

} Slot_State;

//**************************************************************************************************
//***** Forward Declarations ***********************************************************************

void	timeout_isr();
void	grid_timer_isr();

//**************************************************************************************************
//***** Local (Static) Variables *******************************************************************

static struct
{
	Gpi_Hybrid_Tick			event_tick_nominal;
	Gpi_Hybrid_Tick			next_grid_tick;
	Gpi_Hybrid_Tick			next_trigger_tick;
	int32_t					grid_drift;
	int32_t					grid_drift_cumulative;
	uint32_t				rx_trigger_offset;
	uint32_t				tx_trigger_offset;

	Packet					tx_fifo;

	Slot_State				slot_state;
	Slot_Activity			next_slot_task;

#if MX_VERBOSE_STATISTICS
	Gpi_Fast_Tick_Native	radio_start_timestamp;
#endif

} s;

//**************************************************************************************************
//***** Global Variables ***************************************************************************



//**************************************************************************************************
//***** Local Functions ****************************************************************************

// fast memcmp() function for time-critical code
static ALWAYS_INLINE int_fast8_t fast_memcmp(const void* a_, const void* b_, uint_fast8_t size)
{
	// exploit that ARM has native support for unaligned memory access
	ASSERT_CT(GPI_ARCH_IS_CORE(ARM), function_not_optimized_for_selected_CPU_architecture);

	union
	{
		const uint32_t*		p32;
		const uint16_t*		p16;
		const uint8_t*		p8;

	} a, b;

	a.p32 = a_;
	b.p32 = b_;

	for (; size >= 4; size -= 4)
	{
		// NOTE: do not distinguish which one is greater/smaller as real memcmp() does
		if (*a.p32++ != *b.p32++)
			return 1;
	}

	if (size >= 2)
	{
		if (*a.p16++ != *b.p16++)
			return 1;
	}

	if (size >= 1)
	{
		if (*a.p8++ != *b.p8++)
			return 1;
	}

	return 0;
}

//**************************************************************************************************

// trigger grid/timeout timer (immediately)
static inline void trigger_main_timer(int use_int_lock)
{
	register int	tmp, ie;

	if (use_int_lock)
		ie = gpi_int_lock();

	// use asm to safeguard time-critical code
	// 		MAIN_TIMER->TASKS_CAPTURE[MAIN_TIMER_CC_INDEX] = 1;
	// 		MAIN_TIMER->CC[MAIN_TIMER_CC_INDEX] += 3;
	// ATTENTION: some callees rely on the fact that CC_REG gets updated implicitly
	// ATTENTION: Choosing the increment value is difficult due to missing details in the
	// documentation. We found that values < 8 can cause problems (missed events), while
	// values >= 8 seem to work reliable. We use 10 to have some safety margin.
	// NOTE: An alternative could be to trigger the IRQ via NVIC->STIR. Though, one has to
	// check if the masking/unmasking is consistent when implementing it this way.
	__asm__ volatile
	(
		"str	%0, [%1, %2]	\n"
		"ldr	%0, [%1, %3]	\n"
		"add	%0, #10			\n"
		"str	%0, [%1, %3]	\n"
		: "=&r"(tmp)
		: "r"(MAIN_TIMER),
			"i"(offsetof(typeof(*MAIN_TIMER), TASKS_CAPTURE[MAIN_TIMER_CC_INDEX])),
			"i"(offsetof(typeof(*MAIN_TIMER), CC[MAIN_TIMER_CC_INDEX])),
			"0"(1)
		: "memory"
	);

	if (use_int_lock)
		gpi_int_unlock(ie);

