Data-Science-in-Mechanical-Engineering/CATS/hardware_implementation/mixer/src/mixer/nrf52840/mixer_transport_ble.c
	// unmask grid timer interrupt
	unmask_main_timer(0);
}

//**************************************************************************************************

void LED_ISR(RADIO_IRQHandler, LED_RADIO_ISR)
{
	GPI_TRACE_FUNCTION_FAST();
	PROFILE_ISR("radio ISR entry");

	// if Rx
	// NOTE: s.slot_state = RX_RUNNING or RESYNC
	if (TX_RUNNING != s.slot_state)
	{
		// if frame detected
		if (NRF_RADIO->EVENTS_ADDRESS && BV_TEST_BY_VALUE(NRF_RADIO->INTENSET, RADIO_INTENSET_ADDRESS, 1))
		{
			gpi_led_on(LED_RX);
			GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "header detected");

			NRF_RADIO->INTENCLR = BV_BY_VALUE(RADIO_INTENCLR_ADDRESS, 1);

			// NOTE: We leave EVENTS_ADDRESS set. Together with INTEN_ADDRESS,
			// this can be used to evaluate the Rx state:
			// EVENT  INTEN  state
			//   0      0    - (radio off)
			//   0      1    idle, scanning for sync header
			//   1      1    frame header received, IRQ pending
			//   1      0    frame header received and processed, DMA running

			// The received packet is available at PACKETPTR and the BLE header is already stripped.
			volatile uint8_t *len = (uint8_t*)(
				NRF_RADIO->PACKETPTR - offsetof(Packet, ble_header) + offsetof(Packet, len));

			// wait for LEN field
			// NOTE: LEN has been cleared when starting Rx (in grid timer ISR)
			while (!(*len) && BV_TEST_BY_NAME(NRF_RADIO->STATE, RADIO_STATE_STATE, Rx));

			// if LEN is valid
			if (*len == PHY_PAYLOAD_SIZE)
			{
				// update timeout timer to monitor data transfer
				// NOTE: +10us for DMA latency
				MAIN_TIMER_CC_REG = EVENT_CAPTURE_CC_REG + RX_DMA_TIMEOUT + GPI_TICK_US_TO_FAST(10);
				unmask_main_timer(1);
			}

			// if LEN is invalid
			else
			{
				GPI_TRACE_MSG_FAST(TRACE_INFO, "broken packet, LEN: %u", (int)*len);

				#if MX_VERBOSE_STATISTICS
					mx.stat_counter.num_rx_broken++;
				#endif

				// trigger timeout timer (immediately) -> do error handling in its ISR
				trigger_main_timer(0);
			}

			goto _return_;
		}

		// situation at this point: Rx done, radio entering DISABLED state
		// ATTENTION: turning radio off (here: due to shortcut / PPI) is important
		// to avoid disturbing receptions and to safe energy
		// NOTE: We could be here because Bitcounter triggered (i.e., LEN exceeds limit).
		// Since LEN is valid also in this case and BCMATCH triggers RADIO->TASKS_DISABLE
		// (via PPI link), there is no reason to distinguish this case here.

		gpi_led_off(LED_RX);

		// mask radio interrupts and events
		NRF_RADIO->INTENCLR = -1u;
		NRF_PPI->CHENCLR = BV(NRF_PPI_CHANNEL) | BV(NRF_PPI_CHANNEL_2);

		// stop timeout timer
		// -> not needed because this is done implicitely below
		// mask_main_timer();

		#if MX_VERBOSE_STATISTICS
//		if (s.radio_start_timestamp & 1)
		{
			mx.stat_counter.radio_rx_time += gpi_tick_fast_native() - s.radio_start_timestamp;
			s.radio_start_timestamp = 0;
		}
		#endif

		GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "bit counter match: %u", NRF_RADIO->EVENTS_BCMATCH);

		Packet	*packet = (Packet*)(NRF_RADIO->PACKETPTR - offsetof(Packet, ble_header));
//		packet = &mx.rx_queue[mx.rx_queue_num_written % NUM_ELEMENTS(mx.rx_queue)];

		// if LEN or CRC not ok: regard packet as invisible
		if ((packet->len != PHY_PAYLOAD_SIZE) ||
			BV_TEST_BY_NAME(NRF_RADIO->CRCSTATUS, RADIO_CRCSTATUS_CRCSTATUS, CRCError))
		{
			GPI_TRACE_MSG_FAST(TRACE_INFO, "broken packet received, LEN: %u, CRC: %u",
				(int)(packet->len), NRF_RADIO->CRCSTATUS);

			#if MX_VERBOSE_STATISTICS
				mx.stat_counter.num_rx_broken++;
			#endif

			// trigger timeout timer (immediately) -> do error handling there
			// NOTE: don't need to unmask timer here because it already is
			trigger_main_timer(0);

			// invalidate len (in case of CRC errors) to avoid misleading interpretation
			// of timeout reason in timeout ISR
			packet->len = 0;
		}

		// if packet ok: process packet
		else
		{
			PROFILE_ISR("radio ISR process Rx packet begin");

			int	strobe_resync = 0;

			GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "CRC ok");

			#if MX_VERBOSE_STATISTICS
				mx.stat_counter.num_rx_success++;
			#endif

			// update slot timing control values
			{
				Gpi_Hybrid_Tick	event_tick = gpi_tick_fast_to_hybrid(EVENT_CAPTURE_CC_REG);

				ASSERT_CT(sizeof(Gpi_Hybrid_Tick) >= sizeof(uint32_t));

				GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "capture event: nominal: %lu, capture: %lu, deviation: %+ld",
					(long)gpi_tick_hybrid_to_us(s.event_tick_nominal),
					(long)gpi_tick_hybrid_to_us(event_tick),
					gpi_tick_compare_hybrid(event_tick, s.event_tick_nominal) < 0 ?
						-(long)gpi_tick_hybrid_to_us(s.event_tick_nominal - event_tick) :
						(long)gpi_tick_hybrid_to_us(event_tick - s.event_tick_nominal)
				);

				mx.round_deadline_ref_time = event_tick - GRID_TO_RX_EVENT_OFFSET;
				mx.round_deadline_ref_slot = packet->slot_number;

				// if RESYNC requested: realign slot grid based on capture value
				if (RESYNC == s.slot_state)
				{
					s.next_grid_tick = event_tick - GRID_TO_RX_EVENT_OFFSET + MX_SLOT_LENGTH;

					s.grid_drift = 0;
					s.grid_drift_cumulative = 0;
					s.tx_trigger_offset = TX_TO_GRID_OFFSET;

					// don't set Rx window to tight after resync because we don't have
					// any information on grid drift yet
					s.rx_trigger_offset = RX_TO_GRID_OFFSET + (RX_WINDOW_MIN + RX_WINDOW_MAX) / 2;

					s.slot_state = RX_RUNNING;

					mx.slot_number = packet->slot_number;

					GPI_TRACE_MSG_FAST(TRACE_INFO, "(re)synchronized to slot %u", mx.slot_number);
				}

				// else use phase-lock control loop to track grid
				else
				{
					int32_t	gd;

					if (mx.slot_number != packet->slot_number)
					{
						#if MX_VERBOSE_STATISTICS
							mx.stat_counter.num_rx_slot_mismatch++;
						#endif
						GPI_TRACE_MSG_FAST(TRACE_WARNING, "!!! slot_number mismatch: expected: %" PRIu16 ", received: %" PRIu16 " !!!",
							mx.slot_number, packet->slot_number);

						mx.slot_number = packet->slot_number;
						// TODO: should not happen -> start RESYNC?
						// strobe_resync = 1;
					}

					// update grid drift and next grid tick
					// NOTE: s.grid_drift uses fix point format with ld(GRID_DRIFT_FILTER_DIV) fractional digits

					// compute capture event deviation
					// NOTE: result is bounded by Rx window size
					event_tick -= s.event_tick_nominal;

