Data-Science-in-Mechanical-Engineering/CATS/hardware_implementation/mixer/src/mixer/nrf52840/mixer_transport_ble.c
					// keep Rx window in this range (with some margin)
					s.rx_trigger_offset = RX_WINDOW_MIN;
					gd = (uint32_t)MAX(ABS(s.grid_drift / GRID_DRIFT_FILTER_DIV), ABS((int32_t)event_tick));
					if (s.rx_trigger_offset < (uint32_t)gd + RX_WINDOW_INCREMENT)
						s.rx_trigger_offset = (uint32_t)gd + RX_WINDOW_INCREMENT;
					s.rx_trigger_offset += RX_TO_GRID_OFFSET;

					// restore nominal grid tick (i.e. remove previously added control value)
					s.next_grid_tick -= s.grid_drift / (GRID_DRIFT_FILTER_DIV * GRID_TICK_UPDATE_DIV);

					// update grid drift:
					// new = 1/c * measurement + (c-1)/c * old = old - 1/c * old + 1/c * measurement
					// + GRID_DRIFT_FILTER_DIV / 2 leads to rounding
					s.grid_drift -= (s.grid_drift + GRID_DRIFT_FILTER_DIV / 2) / GRID_DRIFT_FILTER_DIV;
					gd = s.grid_drift;
					gd += (int32_t)event_tick;
					s.grid_drift = gd;

					// if drift exceeds limit: start RESYNC
					// NOTE: saturation could also help since obviously we are still able to receive
					// something (at the moment). Nevertheless it seems that we are in a critical
					// situation, so resync appears adequate as well.
					if (ABS(gd) > GRID_DRIFT_MAX)
					{
						#if MX_VERBOSE_STATISTICS
							mx.stat_counter.num_grid_drift_overflow++;
							mx.stat_counter.num_resync++;
						#endif
						GPI_TRACE_MSG_FAST(TRACE_INFO, "grid drift overflow: %d > %d -> enter RESYNC",
							ABS(gd), GRID_DRIFT_MAX);

						strobe_resync = 1;
					}

					else
					{
						// update grid tick
						// NOTE: this realizes the proportional term of a PID controller
						s.next_grid_tick += s.grid_drift / (GRID_DRIFT_FILTER_DIV * GRID_TICK_UPDATE_DIV);

						// keep cumulative grid drift
						// NOTE: this is the base for the integral component of a PID controller
						gd = s.grid_drift_cumulative;
						gd += s.grid_drift;
						if (gd > 0x7FFF)
							gd = 0x7FFF;
						else if (gd < -0x8000l)
							gd = -0x8000l;
						s.grid_drift_cumulative = gd;

						// update tx trigger offset
						// NOTE: this realizes the integral term of a PID controller in an indirect way
						// (through a loopback with potentially high uncertainty on its reaction)
						s.tx_trigger_offset = s.grid_drift_cumulative / (GRID_DRIFT_FILTER_DIV * TX_OFFSET_FILTER_DIV);
						if ((int32_t)s.tx_trigger_offset < 0)
							s.tx_trigger_offset = 0;
						else if (s.tx_trigger_offset > TX_OFFSET_MAX)
							s.tx_trigger_offset = TX_OFFSET_MAX;
						s.tx_trigger_offset += TX_TO_GRID_OFFSET;

						GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "grid_drift_cum: %d, tx_offset: %u",
							s.grid_drift_cumulative, s.tx_trigger_offset - TX_TO_GRID_OFFSET);
					}
				}

				// special handling during start-up phase, see tx decision for details
				#if (MX_COORDINATED_TX && !MX_BENCHMARK_NO_COORDINATED_STARTUP)
					if (mx.slot_number < mx.discovery_exit_slot)
					{
						// ATTENTION: do not rely on mx.tx_sideload or mx.tx_reserve at this point
						// (mx.tx_sideload may change between here and next trigger tick, mx.tx_reserve
						// may point to an incosistent row since it is not guarded w.r.t. ISR level).
						// Instead, there is a very high probability that mx.tx_packet is ready since
						// we did not TX in current slot (otherwise we wouldn't be here).
						if (!strobe_resync && (STOP != s.next_slot_task) &&
							packet->flags.owner_forecast_1 && mx.tx_packet.is_ready)
						{
							GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "tx decision: no startup owner (owner_forecast_1 set)");
							s.next_slot_task = TX;
						}
					}
				#endif

				s.next_trigger_tick = s.next_grid_tick -
					((s.next_slot_task == TX) ? s.tx_trigger_offset : s.rx_trigger_offset);

				GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "next_grid: %lu, grid_drift: %+d (%+dus)",
					(long)gpi_tick_hybrid_to_us(s.next_grid_tick), s.grid_drift,
					(s.grid_drift >= 0) ?
						(int)gpi_tick_hybrid_to_us(s.grid_drift / GRID_DRIFT_FILTER_DIV) :
						-(int)gpi_tick_hybrid_to_us(-s.grid_drift / GRID_DRIFT_FILTER_DIV)
				);
			}

			// check potential queue overflow, if ok: keep packet
			// NOTE: comparison with < instead of <= ensures that at least one queue
			// slot remains available, which can be safely used by the next Rx DMA
			// (i.e. without corrupting other queued packets)
			if (mx.rx_queue_num_writing - mx.rx_queue_num_read < NUM_ELEMENTS(mx.rx_queue))
			{
				mx.rx_queue_num_written++;

				// use packet as next Tx sideload (-> fast tx update)
				if (MX_GENERATION_SIZE != mx.rank)
					mx.tx_sideload = &(packet->coding_vector[0]);

				set_event(RX_READY);

				#if MX_VERBOSE_STATISTICS
					mx.stat_counter.num_received++;
				#endif
			}
			#if MX_VERBOSE_STATISTICS
			else
			{
				GPI_TRACE_MSG_FAST(TRACE_INFO, "Rx queue overflow, NW: %u, NR: %u", mx.rx_queue_num_writing, mx.rx_queue_num_read);

				if (mx.rank < MX_GENERATION_SIZE)
					mx.stat_counter.num_rx_queue_overflow++;
				else mx.stat_counter.num_rx_queue_overflow_full_rank++;
			}
			#endif
			ASSERT_CT(NUM_ELEMENTS(mx.rx_queue) >= 2, single_entry_rx_queue_will_not_work);

			// start RESYNC if requested
			if (strobe_resync)
			{
				#if MX_VERBOSE_STATISTICS
					mx.stat_counter.num_resync++;
				#endif

				enter_resync(0);
			}

			// handover to grid timer (if not already done by enter_resync())
			else start_grid_timer();

			PROFILE_ISR("radio ISR process Rx packet end");
		}
	}

	// if Tx
	else
	{
		// mask radio interrupts and events
		NRF_RADIO->INTENCLR = -1u;

		// situation at this point: transmission completed, radio entering DISABLED state
		// NOTE: radio is turned off automatically due to shortcut

		gpi_led_off(LED_TX);

		#if MX_VERBOSE_STATISTICS
		// if (s.radio_start_timestamp & 1)
		{
			mx.stat_counter.radio_tx_time += gpi_tick_fast_native() - s.radio_start_timestamp;
			s.radio_start_timestamp = 0;
		}
		#endif

		GPI_TRACE_MSG_FAST(TRACE_INFO, "Tx done");
	}

	_return_:
	PROFILE_ISR("radio ISR return");
	GPI_TRACE_RETURN_FAST();
}

//**************************************************************************************************

// grid/timeout timer IRQ dispatcher
// ATTENTION: must be subordinated to gpi fast clock ISR if same timer is used and gpi ISR present
void __attribute__((naked)) MAIN_TIMER_ISR_NAME()
{
	// asm block implements optimized version of the following behavior:
	// switch (s.slot_state)
	// {
	//	case RESYNC:			timeout_isr(); grid_timer_isr();	break;
	//	case RX_RUNNING:		timeout_isr();						break;
	//	case TX_RUNNING, IDLE:	grid_timer_isr();					break;
	//	default:				undefined behavior
	// }
	__asm__ volatile
	(
		"ldr	r0, 1f				\n"		// r0 = s.slot_state
		"ldrb	r0, [r0]			\n"
		"add	pc, r0				\n"		// jump into vector table (see ARM DUI 0553A for details)
		".align 2					\n"		// ensure alignment and correct offset
		"push.w	{lr}				\n"		//  0: resync: call both ISRs (-> return to here)
		"bl.w	timeout_isr			\n"
		"pop.w	{lr}				\n"
		"b.w	grid_timer_isr		\n"		// 12: grid timer (don't return to here)
		"b.w	timeout_isr			\n"		// 16: timeout (don't return to here)
		"1:							\n"
		".word	%c0					\n"
		: : "i"(&s.slot_state)
	);
}

