Data-Science-in-Mechanical-Engineering/CATS/hardware_implementation/mixer/src/mixer/nrf52840/mixer_transport_ble.c
//				// f(x) = (1 - 2 ^ (-0.125 * x)) / (1 - 2 ^ (-0.125))
//				static const uint8_t LUT1[] =
//				{
//					 0,  1,  2,  3,  4,  4,  5,  5,  6,  7,  7,
//					 7,  8,  8,  8,  9,  9,  9, 10, 10, 10, 10,
//					10, 10, 11, 11, 11, 11, 11, 11, 11, 11, 11,
//					11, 11, 11, 12
//				};

				// f(x) = 2 ^ (-x) (scaled)
				// -> could be computed directly, but the (small) LUT is the faster variant
				// NOTE: If there are no pending columns (i.e. using LUT2[0]),
				// then it is not useful to send a (empty) column request,
				// hence we set LUT2[0] to a value that enforces type = IT_ROW_REQUEST.
				static const uint8_t LUT2[] = {0xff, 0x20, 0x10, 0x08, 0x04, 0x02, 0x01};

				uint8_t  	x;
				uint16_t 	age = slot_number - mx.recent_innovative_slot;
				uint8_t	 	rand = mx.tx_packet.rand;		// prepared on thread level

				#if MX_WEAK_ZEROS
					if (slot_number >= mx.weak_zero_release_slot)
						x = LUT1[MIN(MX_GENERATION_SIZE - mx.rank - mx.weak_rank, NUM_ELEMENTS(LUT1) - 1)];
					else
				#endif
				x = LUT1[MIN(MX_GENERATION_SIZE - mx.rank, NUM_ELEMENTS(LUT1) - 1)];

				if ((age >= x) ||
				#if MX_COORDINATED_TX
					#if !MX_BENCHMARK_NO_COORDINATED_STARTUP
						((slot_number >= mx.discovery_exit_slot) && (0 == mx_present_head->num_nodes))
					#else
						(0 == mx_present_head->num_nodes)
					#endif
				#else
					0
				#endif
				)
				{
					if (rand < LUT2[MIN(mx.request.my_column_pending, NUM_ELEMENTS(LUT2) - 1)])
						mx.tx_packet.flags.info_type = IT_ROW_REQUEST;
					else mx.tx_packet.flags.info_type = IT_COLUMN_REQUEST;
				}
			}
			#endif

			#if MX_AGGREGATE
			do
			{
				// don't send aggregate if explicitly marked (e.g. because feature is inactive)
				if (mx.aggregate_tx_hint < 0)
					break;

				#if MX_SMART_SHUTDOWN
					// don't overwrite radio-off signal
					if ((mx.tx_packet.flags.all & EIT_RADIO_OFF_mask) == EIT_RADIO_OFF_pattern)
						break;

					// no need to send aggregate if all nodes are finished
					if ((mx.tx_packet.flags.all & EIT_FULL_RANK_ACK_MAP_mask) == EIT_FULL_RANK_ACK_MAP_pattern)
						break;
				#endif

				// NOTE: in contrast to MX_WEAK_ZEROS, do not consider
				//	// no need to send aggregate if there are no unfinished neighbors
				//	if (0 == mx_present_head->num_nodes)
				//		break;
				// Depending on the aggregate semantics, being finished (i.e. mx.aggregate_is_ready)
				// may not be identical to being complete (i.e. all progress flags set).
				// Hence, we leave this decision to the aggregate handling functions,
				// which can use mx.aggregate_tx_hint to implement the desired behavior.

				// send aggregate if explicitly suggested
				if (mx.aggregate_tx_hint > 0)
				{
					mx.tx_packet.flags.info_type = IT_AGGREGATE;
					break;
				}

				// don't waste chances to send something meaningful
				if (mx.tx_packet.flags.info_type == IT_UNDEFINED)
				{
					mx.tx_packet.flags.info_type = IT_AGGREGATE;
					break;
				}

				// send aggregate with every k-th transmission
				// NOTE: In contrast to weak zero map, aggregate transmission stops
				// when finished (using mx.aggregate_tx_hint, if implemented well).
				// Hence we use a rather high rate to finish aggregation quickly and,
				// in the best case, be finished before number of requests increases.
				#if MX_WEAK_ZEROS
					if (2 == (mx.stat_counter.num_sent & 3))
						mx.tx_packet.flags.info_type = IT_AGGREGATE;
				#else
					if (0 == (mx.stat_counter.num_sent & 1))
						mx.tx_packet.flags.info_type = IT_AGGREGATE;
				#endif
			}
			while (0);
			#endif

			#if MX_WEAK_ZEROS
			do
			{
				// don't send weak zero map if not yet released
				if (slot_number < mx.weak_zero_release_slot)
					break;

				// don't send weak zero map if no weak zeros are known
				if (0 == mx.weak_rank)
					break;

				#if MX_SMART_SHUTDOWN
					// don't overwrite radio-off signal
					if ((mx.tx_packet.flags.all & EIT_RADIO_OFF_mask) == EIT_RADIO_OFF_pattern)
						break;

					// no need to send weak zero map if all nodes are finished
					if ((mx.tx_packet.flags.all & EIT_FULL_RANK_ACK_MAP_mask) == EIT_FULL_RANK_ACK_MAP_pattern)
						break;
				#endif

				// send weak zero map with first transmission
				// NOTE: this behavior is particularly beneficial if the majority of weak zeros
				// is injected at the initiator and if mx.weak_zero_release_slot <= 1
				if (0 == mx.stat_counter.num_sent)
				{
					mx.tx_packet.flags.info_type = IT_WEAK_ZERO_MAP;
					break;
				}

				#if MX_COORDINATED_TX
					// no need to send weak zero map if there are no unfinished neighbors
					if (0 == mx_present_head->num_nodes)
						break;
				#endif

				#if MX_REQUEST
					// send weak zero map if explicitly selected (as the way to help on request)
					if (INT16_MIN == mx.request.help_index)
					{
						mx.tx_packet.flags.info_type = IT_WEAK_ZERO_MAP;
						break;
					}
				#else
					// don't waste chances to send something meaningful
					if (mx.tx_packet.flags.info_type == IT_UNDEFINED)
					{
						mx.tx_packet.flags.info_type = IT_WEAK_ZERO_MAP;
						break;
					}
				#endif

				// send weak zero map with every k-th transmission
				// NOTE: We found that transmitting weak zero map with every 2nd transmission
				// is a bit to aggressive and deteriorates the overall performance
				// (e.g. in the experiments performed for the FLARE paper).
				// Likely too many requests (and row maps) get suppressed.
				// Beyond that, weak zero map (i) gets useless after all nodes know it,
				// and (ii) is actively transmitted on request if helpful (see above).
				// So, we reduce the rate to every 4th transmission.
				if (0 == (mx.stat_counter.num_sent & 3))
					mx.tx_packet.flags.info_type = IT_WEAK_ZERO_MAP;
			}
			while (0);
			#endif

			write_tx_fifo(
				offsetof(Packet, phy_payload_begin), &mx.tx_packet.phy_payload_begin, NULL,
				offsetof(Packet, coding_vector) - offsetof(Packet, phy_payload_begin));
		}

		// write coding vector and payload
		{
			ASSERT_CT(offsetof(Packet, payload) ==
				offsetof(Packet, coding_vector) + sizeof(mx.tx_packet.coding_vector),
				inconsistent_program);

