Data-Science-in-Mechanical-Engineering/CATS/hardware_implementation/mixer/src/mixer/nrf52840/mixer_transport_ble.c
			GPI_TRACE_MSG_FAST(TRACE_INFO, "sideload produced zero-packet -> Tx aborted");
		}

		else
		{
			// unmask IRQ
			NRF_RADIO->EVENTS_END = 0;
//			NVIC_ClearPendingIRQ(RADIO_IRQn);
			NRF_RADIO->INTENSET = BV_BY_VALUE(RADIO_INTENSET_END, 1);

			// update mx.tx_packet to enable evaluation on processing layer
			// NOTE: not all fields are needed for MX_REQUEST,
			// particularly payload could be dropped (e.g. if time is critical)
			#if (MX_VERBOSE_PACKETS || MX_REQUEST)
				gpi_memcpy_dma_aligned(&mx.tx_packet, &s.tx_fifo, sizeof(Packet));
			#endif

			set_event(TX_READY);
			mx.stat_counter.num_sent++;

			GPI_TRACE_MSG_FAST(TRACE_INFO, "Tx started at %u",
				(unsigned int)gpi_tick_hybrid_to_us(gpi_tick_fast_to_hybrid(trigger_tick)));
		}

		s.slot_state = TX_RUNNING;
		mx.tx_packet.is_ready = 0;
		mx.tx_sideload = NULL;
		s.next_slot_task = RX;

		PROFILE_ISR("grid timer ISR start Tx end");
	}

	if (RESYNC != s.slot_state)
	{
		mx.slot_number++;
		set_event(SLOT_UPDATE);

		s.next_grid_tick += MX_SLOT_LENGTH + s.grid_drift / (GRID_DRIFT_FILTER_DIV * GRID_TICK_UPDATE_DIV);

		s.next_trigger_tick = s.next_grid_tick -
			((s.next_slot_task == TX) ? s.tx_trigger_offset : s.rx_trigger_offset);

		if (TX_RUNNING == s.slot_state)
			start_grid_timer();
	}

	GPI_TRACE_MSG_FAST(TRACE_VERBOSE, "slot_state: %d, next_grid: %lu, rx_offset: %u",
		s.slot_state, (unsigned long)gpi_tick_hybrid_to_us(s.next_grid_tick),
		(unsigned int)gpi_tick_hybrid_to_us(s.rx_trigger_offset));

	// set general purpose trigger event
	// compared to SLOT_UPDATE, TRIGGER_TICK is generated also during RESYNC periods (once
	// in a while). It can be used for maintenance tasks that are less time critical.
	set_event(TRIGGER_TICK);

	PROFILE_ISR("grid timer ISR return");
	GPI_TRACE_RETURN_FAST();
}

//**************************************************************************************************
//***** Global Functions ***************************************************************************

void mixer_transport_init()
{
	GPI_TRACE_FUNCTION();

	assert(MX_PHY_MODE == gpi_radio_get_mode());

	// disable PPI channels for sure
	// (in case they are mistakenly in use due to colliding resource assignments)
	NRF_PPI->CHENCLR = BV(NRF_PPI_CHANNEL) | BV(NRF_PPI_CHANNEL_2);

	// connect shortcuts
	// NOTE: alternatively, Tx START could be triggered from timer via PPI
	// -> replace READY_START by RXREADY_START in this case
	NRF_RADIO->SHORTS =
		BV_BY_NAME(RADIO_SHORTS_READY_START, Enabled) |
		BV_BY_NAME(RADIO_SHORTS_END_DISABLE, Enabled) |
		BV_BY_NAME(RADIO_SHORTS_ADDRESS_BCSTART, Enabled);

	// set MAXLEN to avoid Rx buffer overflows
	NRF_RADIO->PCNF1 =
		(NRF_RADIO->PCNF1 & ~RADIO_PCNF1_MAXLEN_Msk) |
		BV_BY_VALUE(RADIO_PCNF1_MAXLEN, PHY_PAYLOAD_SIZE);

	// init Bitcounter to monitor frame length and
	// connect RADIO->EVENTS_BCMATCH to RADIO->TASKS_DISABLE (via PPI)
	// NOTE: We use the Bitcounter in addition to MAXLEN because MAXLEN stops just the DMA transfer,
	// not the whole radio (4413_417 v1.0 page 304). We want to stop the whole radio to safe energy.
	// NOTE: init Bitcounter such that it triggers when LEN > (not >=) nominal length
	NRF_RADIO->BCC = (2 + PHY_PAYLOAD_SIZE + 3) * 8 + 1;
#if ((MX_PHY_MODE == MX_BLE_MODE_125k) || (MX_PHY_MODE == MX_BLE_MODE_500k))
	NRF_RADIO->BCC += 5;	// CI + TERM1
#endif
	NRF_PPI->CH[NRF_PPI_CHANNEL_2].EEP = (uintptr_t)&(NRF_RADIO->EVENTS_BCMATCH);
	NRF_PPI->CH[NRF_PPI_CHANNEL_2].TEP = (uintptr_t)&(NRF_RADIO->TASKS_DISABLE);

	// arm main timer IRQ
	// TODO: main timer could have an ISR outside Mixer -> connect to that's dispatcher if present
	MAIN_TIMER->INTENCLR = -1u;
	NVIC_SetPriority(MAIN_TIMER_IRQ, 0);
	NVIC_ClearPendingIRQ(MAIN_TIMER_IRQ);
	NVIC_EnableIRQ(MAIN_TIMER_IRQ);

	// arm radio IRQ
	NRF_RADIO->INTENCLR = -1u;
	NVIC_SetPriority(RADIO_IRQn, 0);
	NVIC_ClearPendingIRQ(RADIO_IRQn);
	NVIC_EnableIRQ(RADIO_IRQn);

	// TODO: move the following two settings to main function or platform

	// disable deep sleep (not implementated on nRF52840) and sleep-on-exit behavior
	SCB->SCR = 0;

	// set nRF52840 low power submode = low power
	// NOTE: can be changed to constant latency mode if there seem to be problems
	NRF_POWER->TASKS_LOWPWR = 1;

	GPI_TRACE_RETURN();
}

//**************************************************************************************************

void mixer_transport_print_config(void)
{
	#define PRINT(s) printf("%-25s = %" PRId32 "\n", #s, (int32_t)s)

	PRINT(MAX_PROPAGATION_DELAY);
	PRINT(RX_WINDOW_INCREMENT);
	PRINT(RX_WINDOW_MIN);
	PRINT(RX_WINDOW_MAX);
	PRINT(GRID_DRIFT_FILTER_DIV);
	PRINT(GRID_TICK_UPDATE_DIV);
	PRINT(GRID_DRIFT_MAX);
	PRINT(TX_OFFSET_FILTER_DIV);
	PRINT(TX_OFFSET_MAX);
	PRINT(DRIFT_TOLERANCE);
	PRINT(RX_DMA_TIMEOUT);
	PRINT(GRID_TO_RX_EVENT_OFFSET);
	PRINT(JITTER_TOLERANCE);
	PRINT(PACKET_AIR_TIME);

	printf("%-25s = %" PRIu32 " (should be >= 10)\n", "RX_WINDOW / INCREMENT", (uint32_t)((RX_WINDOW_MAX - RX_WINDOW_MIN) / RX_WINDOW_INCREMENT));
	printf("%-25s = %" PRIu32 "\n", "air bytes (excl. pre + adr)", (uint32_t)(offsetof(Packet, phy_payload_end) + 1)); // +1 because offsets begin at 0
	printf("%-25s = %" PRIu32 "\n", "min. slot length",
		(uint32_t)((PACKET_AIR_TIME + RX_TO_GRID_OFFSET + 2 * RX_WINDOW_MAX + GPI_TICK_US_TO_HYBRID(ISR_LATENCY_BUFFER)
		+ GPI_TICK_US_TO_HYBRID(25)
		// + duration of MAX(radio_isr, timeout_isr) = ca. 20us -> take 25us
		// everything times 300ppm (1.0003)
		#if GPI_HYBRID_CLOCK_USE_VHT
			+ GPI_TICK_US_TO_HYBRID(1000000 / GPI_SLOW_CLOCK_RATE + 30)));
		#else
			) * 1.0003));
		#endif

	#undef PRINT
}

//**************************************************************************************************

void mixer_transport_arm_initiator()
{
	GPI_TRACE_FUNCTION();

	s.grid_drift			= 0;
	s.grid_drift_cumulative = 0;
	s.tx_trigger_offset 	= TX_TO_GRID_OFFSET;
	s.rx_trigger_offset		= RX_TO_GRID_OFFSET + (RX_WINDOW_MIN + RX_WINDOW_MAX) / 2;

	GPI_TRACE_RETURN();
}

//**************************************************************************************************

void mixer_transport_start()
{
	GPI_TRACE_FUNCTION_FAST();

